Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_8 (Conv2D)            (None, 133, 238, 256)     2560      
_________________________________________________________________
activation_16 (Activation)   (None, 133, 238, 256)     0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 44, 79, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 42, 77, 64)        147520    
_________________________________________________________________
activation_17 (Activation)   (None, 42, 77, 64)        0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 14, 25, 64)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 22400)             0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 22400)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 64)                1433664   
_________________________________________________________________
activation_18 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_19 (Activation)   (None, 2)                 0         
======================================
Total params: 1,583,874
Trainable params: 1,583,874
Non-trainable params: 0
_________________________________________________________________