Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_4 (Conv2D)            (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_8 (Activation)    (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 117, 128)      147584    
_________________________________________________________________
activation_9 (Activation)    (None, 64, 117, 128)      0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 32, 58, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 237568)            0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 237568)            0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               30408832  
_________________________________________________________________
activation_10 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 258       
_________________________________________________________________
activation_11 (Activation)   (None, 2)                 0         
======================================
Total params: 30,557,954
Trainable params: 30,557,954
Non-trainable params: 0
_________________________________________________________________