Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_2 (Conv2D)            (None, 127, 232, 32)      2624      
_________________________________________________________________
activation_4 (Activation)    (None, 127, 232, 32)      0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 42, 77, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 40, 75, 64)        18496     
_________________________________________________________________
activation_5 (Activation)    (None, 40, 75, 64)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 25, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 13, 25, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 20800)             0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                665632    
_________________________________________________________________
activation_6 (Activation)    (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66        
_________________________________________________________________
activation_7 (Activation)    (None, 2)                 0         
======================================
Total params: 686,818
Trainable params: 686,818
Non-trainable params: 0
_________________________________________________________________