Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_2 (Conv2D)            (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_4 (Activation)    (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 65, 118, 128)      65664     
_________________________________________________________________
activation_5 (Activation)    (None, 65, 118, 128)      0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 32, 59, 128)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 59, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 241664)            0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                15466560  
_________________________________________________________________
activation_6 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_7 (Activation)    (None, 2)                 0         
======================================
Total params: 15,533,634
Trainable params: 15,533,634
Non-trainable params: 0
_________________________________________________________________