Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d (Conv2D)              (None, 129, 234, 32)      1600      
_________________________________________________________________
activation (Activation)      (None, 129, 234, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 64, 117, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 62, 115, 64)       18496     
_________________________________________________________________
activation_1 (Activation)    (None, 62, 115, 64)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 31, 57, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 31, 57, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 113088)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                7237696   
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_3 (Activation)    (None, 2)                 0         
======================================
Total params: 7,257,922
Trainable params: 7,257,922
Non-trainable params: 0
_________________________________________________________________