Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_8 (Conv2D)            (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_16 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_17 (Activation)   (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 118784)            0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 118784)            0         
_________________________________________________________________
dense_8 (Dense)              (None, 64)                7602240   
_________________________________________________________________
activation_18 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_19 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________