Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_2 (Conv2D)            (None, 133, 238, 64)      640       
_________________________________________________________________
activation_4 (Activation)    (None, 133, 238, 64)      0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 66, 119, 64)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 117, 128)      73856     
_________________________________________________________________
activation_5 (Activation)    (None, 64, 117, 128)      0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 32, 58, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 237568)            0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 237568)            0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                15204416  
_________________________________________________________________
activation_6 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_7 (Activation)    (None, 2)                 0         
======================================
Total params: 15,279,042
Trainable params: 15,279,042
Non-trainable params: 0
_________________________________________________________________