Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_36 (Conv2D)           (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_72 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_73 (Activation)   (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 118784)            0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 118784)            0         
_________________________________________________________________
dense_36 (Dense)             (None, 64)                7602240   
_________________________________________________________________
activation_74 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_37 (Dense)             (None, 2)                 130       
_________________________________________________________________
activation_75 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________