Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_8 (Conv2D)            (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_16 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 64, 117, 128)      147584    
_________________________________________________________________
activation_17 (Activation)   (None, 64, 117, 128)      0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 32, 58, 128)       0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 237568)            0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 237568)            0         
_________________________________________________________________
dense_8 (Dense)              (None, 128)               30408832  
_________________________________________________________________
activation_18 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 258       
_________________________________________________________________
activation_19 (Activation)   (None, 2)                 0         
======================================
Total params: 30,557,954
Trainable params: 30,557,954
Non-trainable params: 0
_________________________________________________________________