Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_16 (Conv2D)           (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_32 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_33 (Activation)   (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 118784)            0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 118784)            0         
_________________________________________________________________
dense_16 (Dense)             (None, 64)                7602240   
_________________________________________________________________
activation_34 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 2)                 130       
_________________________________________________________________
activation_35 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________