Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_32 (Conv2D)           (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_64 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_65 (Activation)   (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 118784)            0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 118784)            0         
_________________________________________________________________
dense_32 (Dense)             (None, 64)                7602240   
_________________________________________________________________
activation_66 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_33 (Dense)             (None, 2)                 130       
_________________________________________________________________
activation_67 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________