Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_4 (Conv2D)            (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_8 (Activation)    (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_9 (Activation)    (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 118784)            0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 118784)            0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                7602240   
_________________________________________________________________
activation_10 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_11 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________