Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d (Conv2D)              (None, 133, 238, 128)     1280      
_________________________________________________________________
activation (Activation)      (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 65, 118, 128)      65664     
_________________________________________________________________
activation_1 (Activation)    (None, 65, 118, 128)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 59, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 241664)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                15466560  
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_3 (Activation)    (None, 2)                 0         
======================================
Total params: 15,533,634
Trainable params: 15,533,634
Non-trainable params: 0
_________________________________________________________________