Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d (Conv2D)              (None, 127, 232, 32)      2624      
_________________________________________________________________
activation (Activation)      (None, 127, 232, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 42, 77, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 40, 75, 64)        18496     
_________________________________________________________________
activation_1 (Activation)    (None, 40, 75, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 13, 25, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 13, 25, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 20800)             0         
_________________________________________________________________
dense (Dense)                (None, 32)                665632    
_________________________________________________________________
activation_2 (Activation)    (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 66        
_________________________________________________________________
activation_3 (Activation)    (None, 2)                 0         
======================================
Total params: 686,818
Trainable params: 686,818
Non-trainable params: 0
_________________________________________________________________