Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d (Conv2D)              (None, 133, 238, 64)      640       
_________________________________________________________________
activation (Activation)      (None, 133, 238, 64)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 66, 119, 64)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 117, 128)      73856     
_________________________________________________________________
activation_1 (Activation)    (None, 64, 117, 128)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 58, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 237568)            0         
_________________________________________________________________
dropout (Dropout)            (None, 237568)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                15204416  
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 130       
_________________________________________________________________
activation_3 (Activation)    (None, 2)                 0         
======================================
Total params: 15,279,042
Trainable params: 15,279,042
Non-trainable params: 0
_________________________________________________________________