Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_10 (Conv2D)           (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_20 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_21 (Activation)   (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 118784)            0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 118784)            0         
_________________________________________________________________
dense_10 (Dense)             (None, 64)                7602240   
_________________________________________________________________
activation_22 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 130       
_________________________________________________________________
activation_23 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________