Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_22 (Conv2D)           (None, 133, 238, 128)     1280      
_________________________________________________________________
activation_44 (Activation)   (None, 133, 238, 128)     0         
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 66, 119, 128)      0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 64, 117, 64)       73792     
_________________________________________________________________
activation_45 (Activation)   (None, 64, 117, 64)       0         
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 32, 58, 64)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 118784)            0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 118784)            0         
_________________________________________________________________
dense_22 (Dense)             (None, 64)                7602240   
_________________________________________________________________
activation_46 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 2)                 130       
_________________________________________________________________
activation_47 (Activation)   (None, 2)                 0         
======================================
Total params: 7,677,442
Trainable params: 7,677,442
Non-trainable params: 0
_________________________________________________________________