Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_26 (Conv2D)           (None, 133, 238, 64)      640       
_________________________________________________________________
activation_52 (Activation)   (None, 133, 238, 64)      0         
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 66, 119, 64)       0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 64, 117, 128)      73856     
_________________________________________________________________
activation_53 (Activation)   (None, 64, 117, 128)      0         
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 32, 58, 128)       0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 237568)            0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 237568)            0         
_________________________________________________________________
dense_26 (Dense)             (None, 64)                15204416  
_________________________________________________________________
activation_54 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_27 (Dense)             (None, 2)                 130       
_________________________________________________________________
activation_55 (Activation)   (None, 2)                 0         
======================================
Total params: 15,279,042
Trainable params: 15,279,042
Non-trainable params: 0
_________________________________________________________________