Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
======================================
conv2d_4 (Conv2D)            (None, 127, 232, 32)      2624      
_________________________________________________________________
activation_8 (Activation)    (None, 127, 232, 32)      0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 42, 77, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 40, 75, 64)        18496     
_________________________________________________________________
activation_9 (Activation)    (None, 40, 75, 64)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 13, 25, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 13, 25, 64)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 20800)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                665632    
_________________________________________________________________
activation_10 (Activation)   (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 66        
_________________________________________________________________
activation_11 (Activation)   (None, 2)                 0         
======================================
Total params: 686,818
Trainable params: 686,818
Non-trainable params: 0
_________________________________________________________________